import logging
import os
from gigachat import GigaChat

logger = logging.getLogger(__name__)

giga = None
GIGACHAT_CREDENTIALS = os.environ.get('GIGACHAT_CREDENTIALS')

if GIGACHAT_CREDENTIALS:
    try:
        giga = GigaChat(
            credentials=GIGACHAT_CREDENTIALS,
            verify_ssl_certs=False,
            model="GigaChat-Max"
        )
        logger.info("GigaChat клиент успешно инициализирован.")
    except Exception as e:
        giga = None
        logger.error(f"Не удалось инициализировать GigaChat: {e}")
else:
    logger.warning("GIGACHAT_CREDENTIALS не найдена в переменных окружения. LLM-анализатор будет отключен.")

def recomendation(test: dict, type: str):
    if not giga:
        return "AI-анализатор в данный момент недоступен. Попробуйте позже."

    if type == "CBI":
        prompt = (f"Тебе будут даны ответы на каждый вопрос, опираясь на эти ответы тебе нужно будет дать рекомендации человеку по его состоянию, как проф. психологу"
            f"Тебе будут даны результаты теста CBI с вопросами и шкалой оценок(ответов). "
                  f"Вопросы:"
                 f"""1.Как часто вы чувствуете усталость?",
                    "2.Кажется ли вам, что каждый рабочий час утомителен?",
                    "3.Как часто вы думаете: «Я больше не могу»?",
                    "4.Чувствуете ли вы себя измотанным в конце рабочего дня?",
                    "5.Чувствуете ли вы себя выгоревшим из-за работы?",
                    "6.Разочаровывает ли вас работа с клиентами?",
                    "7.Истощает ли вас работа с клиентами?",
                    "8.Задаётесь ли вы вопросом, как долго ещё сможете работать с клиентами?",
                    "9.Кажется ли вам, что вы отдаёте больше, чем получаете в работе с клиентами?",
                    "10.Является ли ваша работа эмоционально изнуряющей?",
                    "11.Хватает ли у вас энергии для семьи и друзей в свободное время?",
                    "12.Тяжело ли вам работать с клиентами?",
                    "13.Бываете ли вы измотаны утром при мысли о новом рабочем дне?",
                    "14.Как часто вы чувствуете себя изнурённым?",
                    "15.Устали ли вы работать с клиентами?",
                    "16.Как часто вы чувствуете эмоциональное истощение?",
                    "17.Вызывает ли ваша работа у вас разочарование?",
                    "18.Как часто вы физически истощены?",
                    "19.Как часто вы чувствуете слабость и подверженность болезням?""
                 f"Оценки (варианты ответов):
                    "1": "Полностью не согласен",
                    "2": "Скорее не согласен",
                    "3": "Ни согласен, ни не согласен",
                    "4": "Скорее согласен",
                    "5": "Полностью согласен""
                 
                 f"Ниже результаты теста в формате (ID вопроса : ответ) :
                    {test}"""
                )
    elif (type == "OLBI"):
        prompt = (f"Тебе будут даны ответы на каждый вопрос, опираясь на эти ответы тебе нужно будет дать рекомендации человеку по его состоянию, как проф. психологу"
            f"Тебе будут даны результаты теста OLBI с вопросами и шкалой оценок(ответов). "
                  f"Вопросы:"
                 f"""1.Я всегда нахожу в своей работе что-то новое и интересное.",
                    "2.Бывают дни, когда я устаю ещё до прихода на работу.",
                    "3.Всё чаще я говорю о своей работе в негативном ключе.",
                    "4.После работы мне нужно больше времени, чем раньше, чтобы расслабиться и почувствовать себя лучше.",
                    "5.Я хорошо выдерживаю рабочее напряжение.",
                    "6.В последнее время я меньше думаю на работе и выполняю задачи почти автоматически.",
                    "7.Я считаю свою работу позитивным вызовом.",
                    "8.Во время работы я часто чувствую эмоциональное истощение.",
                    "9.Со временем можно отдалиться от такой работы.",
                    "10.После работы у меня достаточно энергии для досуга.",
                    "11.Иногда меня отталкивают мои рабочие обязанности.",
                    "12.После работы я обычно чувствую себя измотанным и уставшим.",
                    "13.Я могу представить себя работающим только в этой сфере.",
                    "14.Обычно я хорошо справляюсь с объёмом работы.",
                    "15.Я чувствую, что всё больше вовлекаюсь в свою работу.",
                    "16.Когда я работаю, я обычно чувствую прилив энергии.""
                 f"Оценки(варианты ответа:
                    "1": "Полностью не согласен",
                    "2": "Скорее не согласен",
                    "3": "Ни согласен, ни не согласен",
                    "4": "Скорее согласен",
                    "5": "Полностью согласен""
                 
                 f"Ниже результаты теста в формате (ID вопроса : ответ) :
                    {test}"""
                 )
    elif (type == "small"):
        prompt = (
            f"""Тебе будут даны ответы на каждый вопрос, опираясь на эти ответы тебе нужно будет дать рекомендации человеку по его состоянию, как проф. психологу"
            f"Оценки(варианты ответа):
                "1": "Полностью не согласен",
                "2": "Скорее не согласен",
                "3": "Ни согласен, ни не согласен",
                "4": "Скорее согласен",
                "5": "Полностью согласен""
                f"Ниже результаты теста в формате (Вопрос : ответ) :"
                f"{test}"""
            )
    try:
        response = giga.chat(prompt)
        evaluation_text = response.choices[0].message.content
        logger.info(f"GigaChat дал совет:\n{evaluation_text}")
        print(evaluation_text)
        return evaluation_text

    except Exception as e:
        logger.error(f"Ошибка при взаимодействии с GigaChat: {e}", exc_info=True)
        return "К сожалению, не удалось получить рекомендации от AI-ассистента. Пожалуйста, попробуйте пройти тест позже."