CBI_QUESTIONS = [
    {"id": 1, "text": "Как часто вы чувствуете усталость?"},
    {"id": 2, "text": "Кажется ли вам, что каждый рабочий час утомителен?"},
    {"id": 3, "text": "Как часто вы думаете: «Я больше не могу»?"},
    {"id": 4, "text": "Чувствуете ли вы себя измотанным в конце рабочего дня?"},
    {"id": 5, "text": "Чувствуете ли вы себя выгоревшим из-за работы?"},
    {"id": 6, "text": "Разочаровывает ли вас работа с клиентами?"},
    {"id": 7, "text": "Истощает ли вас работа с клиентами?"},
    {"id": 8, "text": "Задаётесь ли вы вопросом, как долго ещё сможете работать с клиентами?"},
    {"id": 9, "text": "Кажется ли вам, что вы отдаёте больше, чем получаете в работе с клиентами?"},
    {"id": 10, "text": "Является ли ваша работа эмоционально изнуряющей?"},
    {"id": 11, "text": "Хватает ли у вас энергии для семьи и друзей в свободное время?"},
    {"id": 12, "text": "Тяжело ли вам работать с клиентами?"},
    {"id": 13, "text": "Бываете ли вы измотаны утром при мысли о новом рабочем дне?"},
    {"id": 14, "text": "Как часто вы чувствуете себя изнурённым?"},
    {"id": 15, "text": "Устали ли вы работать с клиентами?"},
    {"id": 16, "text": "Как часто вы чувствуете эмоциональное истощение?"},
    {"id": 17, "text": "Вызывает ли ваша работа у вас разочарование?"},
    {"id": 18, "text": "Как часто вы физически истощены?"},
    {"id": 19, "text": "Как часто вы чувствуете слабость и подверженность болезням?"},
]

OLBI_QUESTIONS = [
    {"id": 1, "text": "Я всегда нахожу в своей работе что-то новое и интересное."},
    {"id": 2, "text": "Бывают дни, когда я устаю ещё до прихода на работу."},
    {"id": 3, "text": "Всё чаще я говорю о своей работе в негативном ключе."},
    {"id": 4, "text": "После работы мне нужно больше времени, чем раньше, чтобы расслабиться и почувствовать себя лучше."},
    {"id": 5, "text": "Я хорошо выдерживаю рабочее напряжение."},
    {"id": 6, "text": "В последнее время я меньше думаю на работе и выполняю задачи почти автоматически."},
    {"id": 7, "text": "Я считаю свою работу позитивным вызовом."},
    {"id": 8, "text": "Во время работы я часто чувствую эмоциональное истощение."},
    {"id": 9, "text": "Со временем можно отдалиться от такой работы."},
    {"id": 10, "text": "После работы у меня достаточно энергии для досуга."},
    {"id": 11, "text": "Иногда меня отталкивают мои рабочие обязанности."},
    {"id": 12, "text": "После работы я обычно чувствую себя измотанным и уставшим."},
    {"id": 13, "text": "Я могу представить себя работающим только в этой сфере."},
    {"id": 14, "text": "Обычно я хорошо справляюсь с объёмом работы."},
    {"id": 15, "text": "Я чувствую, что всё больше вовлекаюсь в свою работу."},
    {"id": 16, "text": "Когда я работаю, я обычно чувствую прилив энергии."},
]

def get_standard_questions(test_type):
    if test_type.upper() == 'CBI':
        return CBI_QUESTIONS
    if test_type.upper() == 'OLBI':
        return OLBI_QUESTIONS
    return None